In [1]:
import pandas as pd
import numpy as np

In [2]:
!ls -la ../data/

total 5692
drwxr-xr-x 17 501 dialout     544 Nov 22 15:52 .
drwxr-xr-x 12 501 dialout     384 Dec 19 21:17 ..
-rw-r--r--  1 501 dialout    6148 Nov 11 19:01 .DS_Store
-rw-r--r--  1 501 dialout   14751 Oct 31 21:47 Data.json
-rw-r--r--  1 501 dialout   72036 Nov  1 17:24 StudentsPerformance.csv
-rw-r--r--  1 501 dialout  583449 Nov  9 20:50 data.zip
-rw-r--r--  1 501 dialout 2055796 Nov  6 17:04 data_sf.xls
drwxr-xr-x 13 501 dialout     416 Nov  9 21:07 data_zip
-rw-r--r--  1 501 dialout   76805 Nov 10 17:47 log.csv
drwxr-xr-x  3 501 dialout      96 Nov 11 19:01 mod_1
-rw-r--r--  1 501 dialout  494431 Nov  9 17:37 movies.xls
-rw-r--r--  1 501 dialout     160 Nov  9 18:54 movies_example.txt
-rw-r--r--  1 501 dialout 2483723 Nov  9 17:39 ratings.xls
-rw-r--r--  1 501 dialout      54 Nov  9 18:54 ratings_example.txt
-rw-r--r--  1 501 dialout     526 Nov 10 18:05 sample.xls
-rw-r--r--  1 501 dialout    9729 Nov 22 15:51 tips.csv
-rw-r--r--  1 501 dialout    3875 Nov 10 17:47 users.csv

In [3]:
logs = pd.read_csv('../data/log.csv', header=None)
users = pd.read_csv('../data/users.csv', encoding='koi8_r', sep='\t')
logs.columns=['user_id', 'time', 'bet', 'win']

In [13]:
logs.loc[:, 1].isna().sum()

15

In [19]:
logs.dropna(subset=[0], axis=1)

                                    0                     1
0    Запись пользователя № - user_919  [2019-01-01 14:06:51
1    Запись пользователя № - user_973  [2019-01-01 14:51:16
2    Запись пользователя № - user_903  [2019-01-01 16:31:16
3    Запись пользователя № - user_954  [2019-01-01 17:17:51
4    Запись пользователя № - user_954  [2019-01-01 21:31:18
..                                ...                   ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58
996                            #error                   NaN
997                            #error                   NaN
998                            #error                   NaN
999                            #error                   NaN

[1000 rows x 2 columns]

In [23]:
logs.dropna(axis=0).shape

(133, 4)

In [26]:
logs.loc[:, [0, 1]].dropna(axis=1)

                                    0
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

In [27]:
logs.columns=['user_id', 'time', 'bet', 'win']
res = pd.concat([logs[['user_id', 'time']].dropna(axis=1), logs[['bet', 'win']]], axis=1)

In [30]:
res.isna()

     user_id    bet    win
0      False   True   True
1      False   True   True
2      False   True   True
3      False   True   True
4      False   True   True
..       ...    ...    ...
995    False  False   True
996    False  False  False
997    False  False   True
998    False  False   True
999    False  False   True

[1000 rows x 3 columns]

In [34]:
pd.isna(np.nan)

True

In [35]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
pd.isna(array)

array([[False,  True, False],
       [False, False,  True]])

In [5]:
display(logs.shape)
logs.drop_duplicates(subset=['user_id', 'time'])

(1000, 4)

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [13]:
def prepare_time(time: str) -> str:
    if time == time and time.startswith('['):
        return time[1::]
    else:
        return time

In [17]:
dates = logs.loc[:, 'time'].dropna(axis=0).apply(prepare_time)
display(dates.head())

0    2019-01-01 14:06:51
1    2019-01-01 14:51:16
2    2019-01-01 16:31:16
3    2019-01-01 17:17:51
4    2019-01-01 21:31:18
Name: time, dtype: object

In [22]:
max_date = pd.to_datetime(arg=dates, format='%Y-%m-%d %H:%M:%S').max()
max_date

Timestamp('2019-04-20 18:10:07')

In [26]:
max_date.strftime(format='%Y-%m-%d')

'2019-04-20'

In [74]:
log = pd.read_csv("../data/log.csv")
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(subset=['time'])

dates = log.loc[:, 'time'].dropna(axis=0).apply(prepare_time)
dates = pd.to_datetime(arg=dates, format='%Y-%m-%d %H:%M:%S')

display(dates.head())

0   2019-01-01 14:51:16
1   2019-01-01 16:31:16
2   2019-01-01 17:17:51
3   2019-01-01 21:31:18
4   2019-01-01 23:34:55
Name: time, dtype: datetime64[ns]

In [75]:
dates.dt.minute.value_counts(ascending=False).head()

36    25
31    23
50    22
43    21
14    21
Name: time, dtype: int64

In [76]:
dates.dt.month.value_counts(ascending=True).head()

4    170
2    259
3    264
1    291
Name: time, dtype: int64

In [77]:
(dates.dt.dayofweek.isin([5, 6])).sum()

283

In [73]:
dates.dt.day_name().isin(['Sunday', 'Saturday']).sum()

283

In [70]:
dates.dt.day_name().value_counts()

Saturday     152
Wednesday    150
Tuesday      149
Friday       135
Monday       135
Thursday     132
Sunday       131
Name: time, dtype: int64

In [98]:
log = pd.read_csv("../data/log.csv")
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(subset=['time'], inplace=True)
log.loc[:, 'time'] = log.loc[:, 'time'].apply(prepare_time)
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'], format='%Y-%m-%d %H:%M:%S')
log.loc[:, 'hour'] = log.loc[:, 'time'].dt.hour

log

,user_id,time,bet,win,hour
0,Запись пользователя № - user_973,2019-01-01 14:51:16,NaN,NaN,14
1,Запись пользователя № - user_903,2019-01-01 16:31:16,NaN,NaN,16
2,Запись пользователя № - user_954,2019-01-01 17:17:51,NaN,NaN,17
3,Запись пользователя № - user_954,2019-01-01 21:31:18,NaN,NaN,21
4,Запись пользователя № - user_917,2019-01-01 23:34:55,156789.0,NaN,23
...,...,...,...,...,...
990,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12
991,Запись пользователя № - user_967,2019-04-20 14:59:36,10154.0,NaN,14
992,Запись пользователя № - user_973,2019-04-20 17:09:56,10254.0,NaN,17
993,Запись пользователя № - user_977,2019-04-20 18:10:07,10354.0,NaN,18
994,Запись пользователя № - user_984,2019-04-20 09:59:58,9754.0,NaN,9

In [87]:
def part_of_day(hour: int) -> str:
    if 0 <= hour <= 5:
        return 'ночь'
    elif 6 <= hour <=  11:
        return 'утро'
    elif 12 <= hour <=  17:
        return 'день'
    elif 18 <= hour <=  23:
        return 'вечер'
    else:
        return 'нельзя определеить'

In [94]:
log.loc[:, 'hour'].apply(part_of_day).value_counts(ascending=True)

вечер    227
день     239
утро     253
ночь     265
Name: hour, dtype: int64

In [4]:
import pandas as pd


def prepare_time(time: str) -> str:
    if time == time and time.startswith('['):
        return time[1::]
    else:
        return time
    

log = pd.read_csv("../data/log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(inplace=True)
log.loc[:, 'time'] = log.loc[:, 'time'].apply(prepare_time)
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'], format='%Y-%m-%d %H:%M:%S')
log.loc[:, 'hour'] = log.loc[:, 'time'].dt.hour

log

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

In [6]:
log = pd.read_csv("../data/log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win'] 
display(log)

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [103]:
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)
(log.loc[:, 'bet'] == 0).sum()

515

In [162]:
def fillna_win(row):  
    if row['win'] == row['win'] and row['win'] > 0:
        return row['win']
    elif (row['win'] != row['win'] or row['win'] == 0) and row['bet'] > 0:
        return -row['bet']
    else:
        return 0

    
# заполним пустые значения признака 'bet'
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)

# заполним пустые значения признака 'win'
log.loc[:, 'win'] = log.apply(lambda row: fillna_win(row), axis=1)

In [122]:
(log.loc[:, 'win'] < 0).sum()

347

In [168]:
log.query('win > 0')

,user_id,time,bet,win,net
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0,1841921.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0,8198222.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0,4649.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0,4467.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0,4019.0
...,...,...,...,...,...
981,#error,NaN,800.0,7035.0,6235.0
986,#error,NaN,10454.0,29972.0,19518.0
987,#error,NaN,10554.0,31634.0,21080.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0,6127.0
996,#error,NaN,10054.0,29265.0,19211.0

In [167]:
def fillna_net(row):  
    if row['win'] < 0:
        return row['win']
    else:
        return row['win'] - row['bet']
    
    
log.loc[:, 'net'] = log.apply(lambda row: fillna_net(row), axis=1)

In [169]:
(log.loc[:, 'net'] > 0).sum()

138

In [178]:
log.loc[log.loc[:, 'net'] > 0, 'net'].mean()

80253.33333333333

In [150]:
# Альтернативный подход из slack
log = pd.read_csv('../data/log.csv', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.bet = log['bet'].fillna(0)
log.win = log['win'].fillna(0)
log['net'] = log['win']-log['bet']
(log.net > 0).sum()

138

In [171]:
log.loc[log.loc[:, 'net'] > 0, 'net'].median()

5347.0

Как можно посчитать среднее значение для столбца bet, не учитывая при подсчете пропуски?

In [179]:
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']

In [180]:
log.bet.mean()

6785.738144329897

In [186]:
log.bet.mean(skipna=True)

6785.738144329897

In [182]:
pd.mean(log['bet'])

AttributeError: module 'pandas' has no attribute 'mean'

In [183]:
log.bet.sum() / log.bet.dropna().shape[0]

6785.738144329897

In [184]:
np.mean(log.bet)

6785.738144329897

In [185]:
log['bet'].dropna().mean()

6785.738144329897

В итоге сведем все преобразования датасета LOG.CSV в один блок кода

In [7]:
def fillna_win(row):  
    if row['win'] == row['win'] and row['win'] > 0:
        return row['win']
    elif (row['win'] != row['win'] or row['win'] == 0) and row['bet'] > 0:
        return -row['bet']
    else:
        return 0


def fillna_net(row):  
    if row['win'] < 0:
        return row['win']
    else:
        return row['win'] - row['bet']


# Загрузим данные
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
    
# заполним пустые значения признака 'bet'
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)

# заполним пустые значения признака 'win'
log.loc[:, 'win'] = log.apply(lambda row: fillna_win(row), axis=1) 

# создадим новый признак 'net' как разницу 'win' и 'bet'
log.loc[:, 'net'] = log.apply(lambda row: fillna_net(row), axis=1)

In [15]:
def check_log(log: pd.DataFrame) -> None:
    x = log.loc[log.loc[:, 'net'] > 0, 'net'].median()
    print(f'Получилось {x}. Должно быть 5347.0 ')

    x = log.loc[log.loc[:, 'net'] > 0, 'net'].mean()
    print(f'Получилось {x}. Должно быть 80253.33333333333 ')

    x = (log.loc[:, 'net'] > 0).sum()
    print(f'Получилось {x}. Должно быть 138 ')

In [16]:
check_log(log)

Получилось 5347.0. Должно быть 5347.0
Получилось 80253.33333333333. Должно быть 80253.33333333333
Получилось 138. Должно быть 138

Альтернативный подход обработки датасета, взятый из slack

In [64]:
# Загрузим данные
log = pd.read_csv('../data/log.csv', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']

# заполним пустые значения признака 'bet'
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)

# заполним пустые значения признака 'win'
log.loc[:, 'win'] = log.loc[:, 'win'].fillna(0)

# создадим новый признак 'net' как разницу 'win' и 'bet'
log.loc[:, 'net'] = log.loc[:, 'win'] - log.loc[:, 'bet']

In [20]:
check_log(log)

Получилось 5347.0. Должно быть 5347.0
Получилось 80253.33333333333. Должно быть 80253.33333333333
Получилось 138. Должно быть 138

In [23]:
(log.loc[:, 'bet'] > 0).sum() / log.shape[0]

0.485

In [26]:
log.loc[log.loc[:, 'bet'] > 0, 'bet'].mean()

6785.738144329897

In [27]:
log.loc[log.loc[:, 'bet'] > 0, 'net'].mean()

20421.892783505155

In [28]:
log.loc[log.loc[:, 'net'] < 0, 'net'].mean()

-3372.743515850144

In [31]:
((log.loc[:, 'bet'] > 0) & (log.loc[:, 'net'] > 0)).sum() / (log.loc[:, 'bet'] > 0).sum()

0.2845360824742268

In [35]:
# еще можно так
log.query('bet > 0 and net > 0').shape[0] / log.query('bet > 0').shape[0]

0.2845360824742268

In [32]:
((log.loc[:, 'bet'] > 0) & (log.loc[:, 'net'] < 0)).sum() / (log.loc[:, 'bet'] > 0).sum()

0.7154639175257732

In [37]:
# еще можно так
log.query('bet > 0 and net < 0').shape[0] / log.query('bet > 0').shape[0]

0.7154639175257732

In [44]:
# Загрузим данные
log = pd.read_csv('../data/log.csv', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']

min_bet_amount = (log.loc[:, 'bet'] == log.loc[:, 'bet'].min()).sum()
min_bet_amount

48

### Повторение merge/groupby

In [125]:
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']

us = pd.read_csv('../data/users.csv', encoding='koi8_r', sep='\t')
us.columns = ['user_id', 'email', 'geo']


# Приведем признак user_id к одному формату в обоих датасетах  
us.loc[:, 'user_id'] = us.loc[:, 'user_id'].apply(lambda x: x.lower())  

# Избавимся от ошибок в user_id  
log = log.loc[log['user_id'] != '#error']  
log.loc[:, 'user_id'] = log.loc[:, 'user_id'].str.split(' - ').apply(lambda x: x[1])  
# заполним пустые значения признака 'bet' и 'win'
log.loc[:, ['bet','win']] = log.loc[:, ['bet','win']].fillna(0)
# создадим новый признак 'net' как разницу 'win' и 'bet'
log.loc[:, 'net'] = log.loc[:, 'win'] - log.loc[:, 'bet']
# Преобразуем признак 'time'
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'].apply(lambda x: x[1::]), 
                                    format='%Y-%m-%d %H:%M:%S')

new_log = pd.merge(log, us, on='user_id', how='inner')
new_log.head()

,user_id,time,bet,win,net,email,geo
0,user_919,2019-01-01 14:06:51,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
1,user_919,2019-01-30 10:06:00,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
2,user_919,2019-02-05 14:33:44,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
3,user_919,2019-02-14 11:38:05,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
4,user_919,2019-03-02 04:23:36,300.0,0.0,-300.0,Chikkaverle@icloud.com,Хабаровск

In [ ]:
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'].apply(lambda x: x[1::]), format='%Y-%m-%d %H:%M:%S')

In [90]:
new_log[new_log.loc[:, 'win'] != 0].groupby('user_id')['win'].median().median()

5951.75

Посчитайте медиану баланса по каждому пользователю. Для этого сгруппируйте по пользователям, возьмите признак net, просуммируйте по каждому пользователю и получите медиану.

In [91]:
new_log.groupby('user_id')['net'].sum().median()

1986.0

Сколько раз в среднем каждый человек приходит, не делая ставок, при условии, что у этого человека все-таки есть хотя бы одна ставка? Например: Человек посетил букмекерскую контору 5 раз из них 1 раз сделал ставку, 4 раза нет - условие выполняется. Человек посетил букмекерскую контору 5 раз из них ни разу ставку не сделал - условие не выполняется. Для того, чтобы узнать это, просуммируйте в каждой группе количество записей со ставкой, равной 0, и поделите на общее количество групп. Если при этом в группе нет записей со ставкой больше 0, считаем количество записей в данной группе равным 0.

In [103]:
# общее количество групп
N = len(new_log.groupby('user_id')['bet'].groups.keys())
N

100

In [112]:
# пользователи, у которых есть хотя бы одна ставка
users_bet = new_log.loc[new_log.loc[:, 'bet'] > 0]['user_id'].unique()

In [116]:
# странное пояснение, решим влоб
new_log.loc[(new_log.loc[:, 'bet'] == 0) 
            & (new_log.loc[:, 'user_id'].isin(users_bet))].groupby('user_id')[['bet']].count().mean()

bet    5.05
dtype: float64

Сколько в среднем времени проходит между появлением человека в сервисе и первой ставкой? Считать нужно только тех, кто делал ставку. Для того, чтобы узнать это, напишите метод, считающий минимальное время среди ставок, равных 0, и минимальное время среди ставок больше 0. После этого верните разницу между вторым и первым числом. Пройдитесь по всем группам в цикле. Если в группе нет ставок больше 0, пропустите эту группу. Просуммируйте разницу во времени для каждой группы (с помощью метода, описанного выше) и поделите на количество групп, которые вы не пропустили.

In [171]:
# Получим таблицы с первым bet = 0 и с первым bet > 0. 
dt_1 = new_log.loc[new_log.loc[:, 'bet'] == 0].groupby('user_id')[['time']].min()
dt_2 = new_log.loc[new_log.loc[:, 'bet'] > 0].groupby('user_id')[['time']].min()
# Сделам мердж типа inner, тем самым выполним условие "Считать нужно только тех, кто делал ставку"
dt = pd.merge(dt_1, dt_2, left_index=True, right_index=True, how='inner')

# Создадим новый признак, разница по времени между первой ставкой и первым посещением
dt.loc[:, 'time_delta'] = dt.loc[:, 'time_y'] - dt.loc[:, 'time_x']
# Обработаем случай, когда посетитель в первый день сделал ставку
dt.loc[dt.loc[:, 'time_delta'].dt.days < 0, 'time_y'] = dt.loc[dt.loc[:, 'time_delta'].dt.days < 0, 'time_x']
dt.loc[dt.loc[:, 'time_delta'].dt.days < 0, 'time_delta'] = pd.Timedelta('00:00:00')

# Получим ответ на заданный вопрос
dt.loc[:, 'time_delta'].dt.days.mean()

46.6

### Анализ по городам

In [172]:
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']

us = pd.read_csv('../data/users.csv', encoding='koi8_r', sep='\t')
us.columns = ['user_id', 'email', 'geo']


# Приведем признак user_id к одному формату в обоих датасетах  
us.loc[:, 'user_id'] = us.loc[:, 'user_id'].apply(lambda x: x.lower())  

# Избавимся от ошибок в user_id  
log = log.loc[log['user_id'] != '#error']  
log.loc[:, 'user_id'] = log.loc[:, 'user_id'].str.split(' - ').apply(lambda x: x[1])  
# заполним пустые значения признака 'bet' и 'win'
log.loc[:, ['bet','win']] = log.loc[:, ['bet','win']].fillna(0)
# создадим новый признак 'net' как разницу 'win' и 'bet'
log.loc[:, 'net'] = log.loc[:, 'win'] - log.loc[:, 'bet']
# Преобразуем признак 'time'
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'].apply(lambda x: x[1::]), 
                                    format='%Y-%m-%d %H:%M:%S')

new_log = pd.merge(log, us, on='user_id', how='inner')
new_log.head()

,user_id,time,bet,win,net,email,geo
0,user_919,2019-01-01 14:06:51,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
1,user_919,2019-01-30 10:06:00,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
2,user_919,2019-02-05 14:33:44,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
3,user_919,2019-02-14 11:38:05,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
4,user_919,2019-03-02 04:23:36,300.0,0.0,-300.0,Chikkaverle@icloud.com,Хабаровск

Наибольший суммарный выигрыш среди всех городов имеет Москва. Посчитайте следующий за ней город. Для этого сгруппируйте по городам, возьмите признак win, просуммируйте по каждому городу, отсортируйте и получите второй город.

In [176]:
new_log.groupby('geo')['win'].sum().sort_values(ascending=False)

geo
Москва             11959741.0
Воронеж              184338.0
Санкт-Петербург      151007.0
Казань                97806.0
Ярославль             97441.0
Ижевск                84895.0
Красноярск            84767.0
Арзангелтск           74375.0
Пермь                 67734.0
Хабаровск             65459.0
Краснодар             62718.0
Ставрополь            46003.0
Екатеринбург          36682.0
Тюмень                 4701.0
Name: win, dtype: float64

Во сколько раз различаются максимальное и минимальное значение средней ставки по городам? Для того, чтобы это посчитать, нужно сгруппировать по городам, взять среднее от признака bet, найти максимальное и минимальное значения, затем поделить одно на другое.

In [180]:
ser = new_log.loc[new_log.loc[:, 'bet'] > 0].groupby('geo')['bet'].mean().sort_values(ascending=False)
display(ser)

geo
Москва             62240.846154
Красноярск          3332.416667
Ставрополь          3165.000000
Пермь               2498.800000
Краснодар           2124.235294
Воронеж             2119.745455
Ижевск              2058.437500
Ярославль           1628.048780
Казань              1572.066667
Хабаровск           1515.400000
Санкт-Петербург     1447.500000
Арзангелтск         1415.911111
Тюмень               560.000000
Екатеринбург         486.956522
Name: bet, dtype: float64

In [183]:
ser[0] / ser[-1]

127.81602335164835

Давайте повторим все, что мы прошли в этой секции. Напишите код, который посчитает, сколько раз пользователи приходили в букмекерскую контору в каждом городе. Для этого:

1. загрузите датасеты log.csv и users.csv;

2. удалите user_id с ошибкой (#error) и приведите признак user_id к одному виду в обоих датасетах;

3. слейте два датасета в один по признаку user_id;

4. сгруппируйте данные по правильному признаку (какому - вам нужно понять самим), затем выберите user_id и воспользуйтесь функцией count() для подсчета наблюдений в каждой группе;

5. результат запишите в sample2 (объект Series).

In [189]:
# Загружаем данные и меняем наименования признаков для log.csv
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
# Загружаем данные и меняем наименования признаков для useers.csv
us = pd.read_csv('../data/users.csv', encoding='koi8_r', sep='\t')
us.columns = ['user_id', 'email', 'geo']

# Избавимся от ошибок в user_id  
log = log.loc[log['user_id'] != '#error'] 

# Приведем признак user_id к одному формату в обоих датасетах  
us.loc[:, 'user_id'] = us.loc[:, 'user_id'].apply(lambda x: x.lower())  
log.loc[:, 'user_id'] = log.loc[:, 'user_id'].str.split(' - ').apply(lambda x: x[1]) 

# заполним пустые значения признака 'bet' и 'win'
log.loc[:, ['bet','win']] = log.loc[:, ['bet','win']].fillna(0)
# создадим новый признак 'net' как разницу 'win' и 'bet'
log.loc[:, 'net'] = log.loc[:, 'win'] - log.loc[:, 'bet']
# Преобразуем признак 'time'
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'].apply(lambda x: x[1::]), 
                                    format='%Y-%m-%d %H:%M:%S')
# Сделаем мердж
new_log = pd.merge(log, us, on='user_id', how='inner')

# Получим ответ
sample2 = new_log.groupby('geo')['user_id'].count()

display(new_log.head())
display(sample2)

,user_id,time,bet,win,net,email,geo
0,user_919,2019-01-01 14:06:51,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
1,user_919,2019-01-30 10:06:00,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
2,user_919,2019-02-05 14:33:44,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
3,user_919,2019-02-14 11:38:05,0.0,0.0,0.0,Chikkaverle@icloud.com,Хабаровск
4,user_919,2019-03-02 04:23:36,300.0,0.0,-300.0,Chikkaverle@icloud.com,Хабаровск

geo
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: user_id, dtype: int64

In [195]:
new_log.loc[:, 'geo'].value_counts()

Санкт-Петербург    115
Арзангелтск         96
Ярославль           89
Воронеж             88
Краснодар           86
Казань              66
Ижевск              61
Москва              61
Хабаровск           60
Красноярск          56
Пермь               55
Екатеринбург        49
Ставрополь          36
Тюмень              32
Name: geo, dtype: int64